In [1]:
# Chapter 5: Getting Started with pandas

In [66]:
import numpy as np

In [68]:
import pandas as pd

In [7]:
from pandas import Series, DataFrame

In [9]:
obj = pd.Series([4, 7, -5, 3])

In [11]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [15]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [19]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [23]:
obj2["a"]

-5

In [25]:
obj2["d"] = 6

In [27]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [29]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [31]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [33]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [35]:
"b" in obj2

True

In [37]:
"e" in obj2

False

In [41]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [43]:
obj3 = pd.Series(sdata)

In [45]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [49]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [51]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [53]:
obj4 = pd.Series(sdata, index=states)

In [57]:
obj4 # NaN (Not a Number)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [59]:
# Use the terms “missing,” “NA,” or “null” interchangeably to refer to missing data.

In [61]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [63]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [67]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [69]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [71]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [73]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [75]:
obj4.name = "population"

In [77]:
obj4.index.name = "state"

In [79]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [81]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [83]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [85]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [70]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [72]:
frame = pd.DataFrame(data)

In [74]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [76]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [78]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [80]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [82]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [84]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [86]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [88]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [90]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [92]:
# frame2[column] works for any column name, 
# but frame2.column works only when the column name is a valid Python variable name 
# and does not conflict with any of the method names in DataFrame.

In [94]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [96]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [98]:
frame2["debt"] = 16.5

In [100]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [102]:
frame2["debt"] = np.arange(6.)

In [104]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [106]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [108]:
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [110]:
frame2["debt"] = val

In [112]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [114]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [116]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [120]:
# New columns cannot be created with the frame2.eastern dot attribute notation.

In [122]:
del frame2["eastern"]

In [124]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [126]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [128]:
# The column can be explicitly copied with the Series’s copy method.

In [130]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [132]:
frame3 = pd.DataFrame(populations)

In [134]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [136]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [142]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [144]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}

In [148]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4